Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D29_DFP/component/pmc.h
/* -------- CKGR_PLLAR : (PMC Offset: 0x28) (R/W 32) PLLA Register -------- */
#define CKGR_PLLAR_DIVA_Pos                   _UINT32_(0)                                          /* (CKGR_PLLAR) Divider A Position */
#define CKGR_PLLAR_DIVA_Msk                   (_UINT32_(0x1) << CKGR_PLLAR_DIVA_Pos)               /* (CKGR_PLLAR) Divider A Mask */
#define CKGR_PLLAR_DIVA(value)                (CKGR_PLLAR_DIVA_Msk & (_UINT32_(value) << CKGR_PLLAR_DIVA_Pos)) /* Assigment of value for DIVA in the CKGR_PLLAR register */
#define CKGR_PLLAR_PLLACOUNT_Pos              _UINT32_(8)                                          /* (CKGR_PLLAR) PLLA Counter Position */
#define CKGR_PLLAR_PLLACOUNT_Msk              (_UINT32_(0x3F) << CKGR_PLLAR_PLLACOUNT_Pos)         /* (CKGR_PLLAR) PLLA Counter Mask */
#define CKGR_PLLAR_PLLACOUNT(value)           (CKGR_PLLAR_PLLACOUNT_Msk & (_UINT32_(value) << CKGR_PLLAR_PLLACOUNT_Pos)) /* Assigment of value for PLLACOUNT in the CKGR_PLLAR register */
#define CKGR_PLLAR_OUTA_Pos                   _UINT32_(14)                                         /* (CKGR_PLLAR) PLLA Clock Frequency Range Position */
#define CKGR_PLLAR_OUTA_Msk                   (_UINT32_(0xF) << CKGR_PLLAR_OUTA_Pos)               /* (CKGR_PLLAR) PLLA Clock Frequency Range Mask */
#define CKGR_PLLAR_OUTA(value)                (CKGR_PLLAR_OUTA_Msk & (_UINT32_(value) << CKGR_PLLAR_OUTA_Pos)) /* Assigment of value for OUTA in the CKGR_PLLAR register */
#define CKGR_PLLAR_MULA_Pos                   _UINT32_(18)                                         /* (CKGR_PLLAR) PLLA Multiplier Position */
#define CKGR_PLLAR_MULA_Msk                   (_UINT32_(0x7F) << CKGR_PLLAR_MULA_Pos)              /* (CKGR_PLLAR) PLLA Multiplier Mask */
#define CKGR_PLLAR_MULA(value)                (CKGR_PLLAR_MULA_Msk & (_UINT32_(value) << CKGR_PLLAR_MULA_Pos)) /* Assigment of value for MULA in the CKGR_PLLAR register */
#define CKGR_PLLAR_ONE_Pos                    _UINT32_(29)                                         /* (CKGR_PLLAR) Must Be Set to 1 Position */
#define CKGR_PLLAR_ONE_Msk                    (_UINT32_(0x1) << CKGR_PLLAR_ONE_Pos)                /* (CKGR_PLLAR) Must Be Set to 1 Mask */
#define CKGR_PLLAR_ONE(value)                 (CKGR_PLLAR_ONE_Msk & (_UINT32_(value) << CKGR_PLLAR_ONE_Pos)) /* Assigment of value for ONE in the CKGR_PLLAR register */
#define CKGR_PLLAR_Msk                        _UINT32_(0x21FFFF01)                                 /* (CKGR_PLLAR) Register Mask  */


/* -------- PMC_MCKR : (PMC Offset: 0x30) (R/W 32) Master Clock Register -------- */
#define PMC_MCKR_CSS_Pos                      _UINT32_(0)                                          /* (PMC_MCKR) Master/Processor Clock Source Selection Position */
#define PMC_MCKR_CSS_Msk                      (_UINT32_(0x3) << PMC_MCKR_CSS_Pos)                  /* (PMC_MCKR) Master/Processor Clock Source Selection Mask */
#define PMC_MCKR_CSS(value)                   (PMC_MCKR_CSS_Msk & (_UINT32_(value) << PMC_MCKR_CSS_Pos)) /* Assigment of value for CSS in the PMC_MCKR register */
#define   PMC_MCKR_CSS_SLOW_CLK_Val           _UINT32_(0x0)                                        /* (PMC_MCKR) Slow clock is selected  */
#define   PMC_MCKR_CSS_MAIN_CLK_Val           _UINT32_(0x1)                                        /* (PMC_MCKR) Main clock is selected  */
#define   PMC_MCKR_CSS_PLLA_CLK_Val           _UINT32_(0x2)                                        /* (PMC_MCKR) PLLACK is selected  */
#define   PMC_MCKR_CSS_UPLL_CLK_Val           _UINT32_(0x3)                                        /* (PMC_MCKR) UPLL Clock is selected  */
#define PMC_MCKR_CSS_SLOW_CLK                 (PMC_MCKR_CSS_SLOW_CLK_Val << PMC_MCKR_CSS_Pos)      /* (PMC_MCKR) Slow clock is selected Position  */
#define PMC_MCKR_CSS_MAIN_CLK                 (PMC_MCKR_CSS_MAIN_CLK_Val << PMC_MCKR_CSS_Pos)      /* (PMC_MCKR) Main clock is selected Position  */
#define PMC_MCKR_CSS_PLLA_CLK                 (PMC_MCKR_CSS_PLLA_CLK_Val << PMC_MCKR_CSS_Pos)      /* (PMC_MCKR) PLLACK is selected Position  */
#define PMC_MCKR_CSS_UPLL_CLK                 (PMC_MCKR_CSS_UPLL_CLK_Val << PMC_MCKR_CSS_Pos)      /* (PMC_MCKR) UPLL Clock is selected Position  */
#define PMC_MCKR_PRES_Pos                     _UINT32_(4)                                          /* (PMC_MCKR) Master/Processor Clock Prescaler Position */
#define PMC_MCKR_PRES_Msk                     (_UINT32_(0x7) << PMC_MCKR_PRES_Pos)                 /* (PMC_MCKR) Master/Processor Clock Prescaler Mask */
#define PMC_MCKR_PRES(value)                  (PMC_MCKR_PRES_Msk & (_UINT32_(value) << PMC_MCKR_PRES_Pos)) /* Assigment of value for PRES in the PMC_MCKR register */
#define   PMC_MCKR_PRES_CLOCK_Val             _UINT32_(0x0)                                        /* (PMC_MCKR) Selected clock  */
#define   PMC_MCKR_PRES_CLOCK_DIV2_Val        _UINT32_(0x1)                                        /* (PMC_MCKR) Selected clock divided by 2  */
#define   PMC_MCKR_PRES_CLOCK_DIV4_Val        _UINT32_(0x2)                                        /* (PMC_MCKR) Selected clock divided by 4  */
#define   PMC_MCKR_PRES_CLOCK_DIV8_Val        _UINT32_(0x3)                                        /* (PMC_MCKR) Selected clock divided by 8  */
#define   PMC_MCKR_PRES_CLOCK_DIV16_Val       _UINT32_(0x4)                                        /* (PMC_MCKR) Selected clock divided by 16  */
#define   PMC_MCKR_PRES_CLOCK_DIV32_Val       _UINT32_(0x5)                                        /* (PMC_MCKR) Selected clock divided by 32  */
#define   PMC_MCKR_PRES_CLOCK_DIV64_Val       _UINT32_(0x6)                                        /* (PMC_MCKR) Selected clock divided by 64  */
#define PMC_MCKR_PRES_CLOCK                   (PMC_MCKR_PRES_CLOCK_Val << PMC_MCKR_PRES_Pos)       /* (PMC_MCKR) Selected clock Position  */
#define PMC_MCKR_PRES_CLOCK_DIV2              (PMC_MCKR_PRES_CLOCK_DIV2_Val << PMC_MCKR_PRES_Pos)  /* (PMC_MCKR) Selected clock divided by 2 Position  */
#define PMC_MCKR_PRES_CLOCK_DIV4              (PMC_MCKR_PRES_CLOCK_DIV4_Val << PMC_MCKR_PRES_Pos)  /* (PMC_MCKR) Selected clock divided by 4 Position  */
#define PMC_MCKR_PRES_CLOCK_DIV8              (PMC_MCKR_PRES_CLOCK_DIV8_Val << PMC_MCKR_PRES_Pos)  /* (PMC_MCKR) Selected clock divided by 8 Position  */
#define PMC_MCKR_PRES_CLOCK_DIV16             (PMC_MCKR_PRES_CLOCK_DIV16_Val << PMC_MCKR_PRES_Pos) /* (PMC_MCKR) Selected clock divided by 16 Position  */
#define PMC_MCKR_PRES_CLOCK_DIV32             (PMC_MCKR_PRES_CLOCK_DIV32_Val << PMC_MCKR_PRES_Pos) /* (PMC_MCKR) Selected clock divided by 32 Position  */
#define PMC_MCKR_PRES_CLOCK_DIV64             (PMC_MCKR_PRES_CLOCK_DIV64_Val << PMC_MCKR_PRES_Pos) /* (PMC_MCKR) Selected clock divided by 64 Position  */
#define PMC_MCKR_MDIV_Pos                     _UINT32_(8)                                          /* (PMC_MCKR) Master Clock Division Position */
#define PMC_MCKR_MDIV_Msk                     (_UINT32_(0x3) << PMC_MCKR_MDIV_Pos)                 /* (PMC_MCKR) Master Clock Division Mask */
#define PMC_MCKR_MDIV(value)                  (PMC_MCKR_MDIV_Msk & (_UINT32_(value) << PMC_MCKR_MDIV_Pos)) /* Assigment of value for MDIV in the PMC_MCKR register */
#define   PMC_MCKR_MDIV_EQ_PCK_Val            _UINT32_(0x0)                                        /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 1.Warning: DDRCK is not available.  */
#define   PMC_MCKR_MDIV_PCK_DIV2_Val          _UINT32_(0x1)                                        /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 2. DDRCK is equal to MCK.  */
#define   PMC_MCKR_MDIV_PCK_DIV4_Val          _UINT32_(0x2)                                        /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 4. DDRCK is equal to MCK.  */
#define   PMC_MCKR_MDIV_PCK_DIV3_Val          _UINT32_(0x3)                                        /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 3. DDRCK is equal to MCK.  */
#define PMC_MCKR_MDIV_EQ_PCK                  (PMC_MCKR_MDIV_EQ_PCK_Val << PMC_MCKR_MDIV_Pos)      /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 1.Warning: DDRCK is not available. Position  */
#define PMC_MCKR_MDIV_PCK_DIV2                (PMC_MCKR_MDIV_PCK_DIV2_Val << PMC_MCKR_MDIV_Pos)    /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 2. DDRCK is equal to MCK. Position  */
#define PMC_MCKR_MDIV_PCK_DIV4                (PMC_MCKR_MDIV_PCK_DIV4_Val << PMC_MCKR_MDIV_Pos)    /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 4. DDRCK is equal to MCK. Position  */
#define PMC_MCKR_MDIV_PCK_DIV3                (PMC_MCKR_MDIV_PCK_DIV3_Val << PMC_MCKR_MDIV_Pos)    /* (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 3. DDRCK is equal to MCK. Position  */
#define PMC_MCKR_PLLADIV2_Pos                 _UINT32_(12)                                         /* (PMC_MCKR) PLLA Divisor by 2 Position */
#define PMC_MCKR_PLLADIV2_Msk                 (_UINT32_(0x1) << PMC_MCKR_PLLADIV2_Pos)             /* (PMC_MCKR) PLLA Divisor by 2 Mask */
#define PMC_MCKR_PLLADIV2(value)              (PMC_MCKR_PLLADIV2_Msk & (_UINT32_(value) << PMC_MCKR_PLLADIV2_Pos)) /* Assigment of value for PLLADIV2 in the PMC_MCKR register */
#define PMC_MCKR_H32MXDIV_Pos                 _UINT32_(24)                                         /* (PMC_MCKR) AHB 32-bit Matrix Divisor Position */
#define PMC_MCKR_H32MXDIV_Msk                 (_UINT32_(0x1) << PMC_MCKR_H32MXDIV_Pos)             /* (PMC_MCKR) AHB 32-bit Matrix Divisor Mask */
#define PMC_MCKR_H32MXDIV(value)              (PMC_MCKR_H32MXDIV_Msk & (_UINT32_(value) << PMC_MCKR_H32MXDIV_Pos)) /* Assigment of value for H32MXDIV in the PMC_MCKR register */
#define   PMC_MCKR_H32MXDIV_H32MXDIV1_Val     _UINT32_(0x0)                                        /* (PMC_MCKR) The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency. It is possible only if the AHB 64-bit Matrix frequency does not exceed 83 MHz.  */
#define   PMC_MCKR_H32MXDIV_H32MXDIV2_Val     _UINT32_(0x1)                                        /* (PMC_MCKR) The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency divided by 2.  */
#define PMC_MCKR_H32MXDIV_H32MXDIV1           (PMC_MCKR_H32MXDIV_H32MXDIV1_Val << PMC_MCKR_H32MXDIV_Pos) /* (PMC_MCKR) The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency. It is possible only if the AHB 64-bit Matrix frequency does not exceed 83 MHz. Position  */
#define PMC_MCKR_H32MXDIV_H32MXDIV2           (PMC_MCKR_H32MXDIV_H32MXDIV2_Val << PMC_MCKR_H32MXDIV_Pos) /* (PMC_MCKR) The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency divided by 2. Position  */
#define PMC_MCKR_Msk                          _UINT32_(0x01001373)                                 /* (PMC_MCKR) Register Mask  */

#define PMC_MCKR_PLLADIV_Pos                  _UINT32_(12)                                         /* (PMC_MCKR Position) PLLA Divisor by 2 */
#define PMC_MCKR_PLLADIV_Msk                  (_UINT32_(0x1) << PMC_MCKR_PLLADIV_Pos)              /* (PMC_MCKR Mask) PLLADIV */
#define PMC_MCKR_PLLADIV(value)               (PMC_MCKR_PLLADIV_Msk & (_UINT32_(value) << PMC_MCKR_PLLADIV_Pos)) 

