Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D29_DFP/component/pmc.h
/* -------- PMC_PCDR1 : (PMC Offset: 0x104) ( /W 32) Peripheral Clock Disable Register 1 -------- */
#define PMC_PCDR1_PID32_Pos                   _UINT32_(0)                                          /* (PMC_PCDR1) Peripheral Clock 32 Disable Position */
#define PMC_PCDR1_PID32_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID32_Pos)               /* (PMC_PCDR1) Peripheral Clock 32 Disable Mask */
#define PMC_PCDR1_PID32(value)                (PMC_PCDR1_PID32_Msk & (_UINT32_(value) << PMC_PCDR1_PID32_Pos)) /* Assigment of value for PID32 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID33_Pos                   _UINT32_(1)                                          /* (PMC_PCDR1) Peripheral Clock 33 Disable Position */
#define PMC_PCDR1_PID33_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID33_Pos)               /* (PMC_PCDR1) Peripheral Clock 33 Disable Mask */
#define PMC_PCDR1_PID33(value)                (PMC_PCDR1_PID33_Msk & (_UINT32_(value) << PMC_PCDR1_PID33_Pos)) /* Assigment of value for PID33 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID34_Pos                   _UINT32_(2)                                          /* (PMC_PCDR1) Peripheral Clock 34 Disable Position */
#define PMC_PCDR1_PID34_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID34_Pos)               /* (PMC_PCDR1) Peripheral Clock 34 Disable Mask */
#define PMC_PCDR1_PID34(value)                (PMC_PCDR1_PID34_Msk & (_UINT32_(value) << PMC_PCDR1_PID34_Pos)) /* Assigment of value for PID34 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID35_Pos                   _UINT32_(3)                                          /* (PMC_PCDR1) Peripheral Clock 35 Disable Position */
#define PMC_PCDR1_PID35_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID35_Pos)               /* (PMC_PCDR1) Peripheral Clock 35 Disable Mask */
#define PMC_PCDR1_PID35(value)                (PMC_PCDR1_PID35_Msk & (_UINT32_(value) << PMC_PCDR1_PID35_Pos)) /* Assigment of value for PID35 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID36_Pos                   _UINT32_(4)                                          /* (PMC_PCDR1) Peripheral Clock 36 Disable Position */
#define PMC_PCDR1_PID36_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID36_Pos)               /* (PMC_PCDR1) Peripheral Clock 36 Disable Mask */
#define PMC_PCDR1_PID36(value)                (PMC_PCDR1_PID36_Msk & (_UINT32_(value) << PMC_PCDR1_PID36_Pos)) /* Assigment of value for PID36 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID37_Pos                   _UINT32_(5)                                          /* (PMC_PCDR1) Peripheral Clock 37 Disable Position */
#define PMC_PCDR1_PID37_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID37_Pos)               /* (PMC_PCDR1) Peripheral Clock 37 Disable Mask */
#define PMC_PCDR1_PID37(value)                (PMC_PCDR1_PID37_Msk & (_UINT32_(value) << PMC_PCDR1_PID37_Pos)) /* Assigment of value for PID37 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID38_Pos                   _UINT32_(6)                                          /* (PMC_PCDR1) Peripheral Clock 38 Disable Position */
#define PMC_PCDR1_PID38_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID38_Pos)               /* (PMC_PCDR1) Peripheral Clock 38 Disable Mask */
#define PMC_PCDR1_PID38(value)                (PMC_PCDR1_PID38_Msk & (_UINT32_(value) << PMC_PCDR1_PID38_Pos)) /* Assigment of value for PID38 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID39_Pos                   _UINT32_(7)                                          /* (PMC_PCDR1) Peripheral Clock 39 Disable Position */
#define PMC_PCDR1_PID39_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID39_Pos)               /* (PMC_PCDR1) Peripheral Clock 39 Disable Mask */
#define PMC_PCDR1_PID39(value)                (PMC_PCDR1_PID39_Msk & (_UINT32_(value) << PMC_PCDR1_PID39_Pos)) /* Assigment of value for PID39 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID40_Pos                   _UINT32_(8)                                          /* (PMC_PCDR1) Peripheral Clock 40 Disable Position */
#define PMC_PCDR1_PID40_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID40_Pos)               /* (PMC_PCDR1) Peripheral Clock 40 Disable Mask */
#define PMC_PCDR1_PID40(value)                (PMC_PCDR1_PID40_Msk & (_UINT32_(value) << PMC_PCDR1_PID40_Pos)) /* Assigment of value for PID40 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID41_Pos                   _UINT32_(9)                                          /* (PMC_PCDR1) Peripheral Clock 41 Disable Position */
#define PMC_PCDR1_PID41_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID41_Pos)               /* (PMC_PCDR1) Peripheral Clock 41 Disable Mask */
#define PMC_PCDR1_PID41(value)                (PMC_PCDR1_PID41_Msk & (_UINT32_(value) << PMC_PCDR1_PID41_Pos)) /* Assigment of value for PID41 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID42_Pos                   _UINT32_(10)                                         /* (PMC_PCDR1) Peripheral Clock 42 Disable Position */
#define PMC_PCDR1_PID42_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID42_Pos)               /* (PMC_PCDR1) Peripheral Clock 42 Disable Mask */
#define PMC_PCDR1_PID42(value)                (PMC_PCDR1_PID42_Msk & (_UINT32_(value) << PMC_PCDR1_PID42_Pos)) /* Assigment of value for PID42 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID43_Pos                   _UINT32_(11)                                         /* (PMC_PCDR1) Peripheral Clock 43 Disable Position */
#define PMC_PCDR1_PID43_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID43_Pos)               /* (PMC_PCDR1) Peripheral Clock 43 Disable Mask */
#define PMC_PCDR1_PID43(value)                (PMC_PCDR1_PID43_Msk & (_UINT32_(value) << PMC_PCDR1_PID43_Pos)) /* Assigment of value for PID43 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID44_Pos                   _UINT32_(12)                                         /* (PMC_PCDR1) Peripheral Clock 44 Disable Position */
#define PMC_PCDR1_PID44_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID44_Pos)               /* (PMC_PCDR1) Peripheral Clock 44 Disable Mask */
#define PMC_PCDR1_PID44(value)                (PMC_PCDR1_PID44_Msk & (_UINT32_(value) << PMC_PCDR1_PID44_Pos)) /* Assigment of value for PID44 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID45_Pos                   _UINT32_(13)                                         /* (PMC_PCDR1) Peripheral Clock 45 Disable Position */
#define PMC_PCDR1_PID45_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID45_Pos)               /* (PMC_PCDR1) Peripheral Clock 45 Disable Mask */
#define PMC_PCDR1_PID45(value)                (PMC_PCDR1_PID45_Msk & (_UINT32_(value) << PMC_PCDR1_PID45_Pos)) /* Assigment of value for PID45 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID46_Pos                   _UINT32_(14)                                         /* (PMC_PCDR1) Peripheral Clock 46 Disable Position */
#define PMC_PCDR1_PID46_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID46_Pos)               /* (PMC_PCDR1) Peripheral Clock 46 Disable Mask */
#define PMC_PCDR1_PID46(value)                (PMC_PCDR1_PID46_Msk & (_UINT32_(value) << PMC_PCDR1_PID46_Pos)) /* Assigment of value for PID46 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID47_Pos                   _UINT32_(15)                                         /* (PMC_PCDR1) Peripheral Clock 47 Disable Position */
#define PMC_PCDR1_PID47_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID47_Pos)               /* (PMC_PCDR1) Peripheral Clock 47 Disable Mask */
#define PMC_PCDR1_PID47(value)                (PMC_PCDR1_PID47_Msk & (_UINT32_(value) << PMC_PCDR1_PID47_Pos)) /* Assigment of value for PID47 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID48_Pos                   _UINT32_(16)                                         /* (PMC_PCDR1) Peripheral Clock 48 Disable Position */
#define PMC_PCDR1_PID48_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID48_Pos)               /* (PMC_PCDR1) Peripheral Clock 48 Disable Mask */
#define PMC_PCDR1_PID48(value)                (PMC_PCDR1_PID48_Msk & (_UINT32_(value) << PMC_PCDR1_PID48_Pos)) /* Assigment of value for PID48 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID49_Pos                   _UINT32_(17)                                         /* (PMC_PCDR1) Peripheral Clock 49 Disable Position */
#define PMC_PCDR1_PID49_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID49_Pos)               /* (PMC_PCDR1) Peripheral Clock 49 Disable Mask */
#define PMC_PCDR1_PID49(value)                (PMC_PCDR1_PID49_Msk & (_UINT32_(value) << PMC_PCDR1_PID49_Pos)) /* Assigment of value for PID49 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID50_Pos                   _UINT32_(18)                                         /* (PMC_PCDR1) Peripheral Clock 50 Disable Position */
#define PMC_PCDR1_PID50_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID50_Pos)               /* (PMC_PCDR1) Peripheral Clock 50 Disable Mask */
#define PMC_PCDR1_PID50(value)                (PMC_PCDR1_PID50_Msk & (_UINT32_(value) << PMC_PCDR1_PID50_Pos)) /* Assigment of value for PID50 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID51_Pos                   _UINT32_(19)                                         /* (PMC_PCDR1) Peripheral Clock 51 Disable Position */
#define PMC_PCDR1_PID51_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID51_Pos)               /* (PMC_PCDR1) Peripheral Clock 51 Disable Mask */
#define PMC_PCDR1_PID51(value)                (PMC_PCDR1_PID51_Msk & (_UINT32_(value) << PMC_PCDR1_PID51_Pos)) /* Assigment of value for PID51 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID52_Pos                   _UINT32_(20)                                         /* (PMC_PCDR1) Peripheral Clock 52 Disable Position */
#define PMC_PCDR1_PID52_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID52_Pos)               /* (PMC_PCDR1) Peripheral Clock 52 Disable Mask */
#define PMC_PCDR1_PID52(value)                (PMC_PCDR1_PID52_Msk & (_UINT32_(value) << PMC_PCDR1_PID52_Pos)) /* Assigment of value for PID52 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID53_Pos                   _UINT32_(21)                                         /* (PMC_PCDR1) Peripheral Clock 53 Disable Position */
#define PMC_PCDR1_PID53_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID53_Pos)               /* (PMC_PCDR1) Peripheral Clock 53 Disable Mask */
#define PMC_PCDR1_PID53(value)                (PMC_PCDR1_PID53_Msk & (_UINT32_(value) << PMC_PCDR1_PID53_Pos)) /* Assigment of value for PID53 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID54_Pos                   _UINT32_(22)                                         /* (PMC_PCDR1) Peripheral Clock 54 Disable Position */
#define PMC_PCDR1_PID54_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID54_Pos)               /* (PMC_PCDR1) Peripheral Clock 54 Disable Mask */
#define PMC_PCDR1_PID54(value)                (PMC_PCDR1_PID54_Msk & (_UINT32_(value) << PMC_PCDR1_PID54_Pos)) /* Assigment of value for PID54 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID55_Pos                   _UINT32_(23)                                         /* (PMC_PCDR1) Peripheral Clock 55 Disable Position */
#define PMC_PCDR1_PID55_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID55_Pos)               /* (PMC_PCDR1) Peripheral Clock 55 Disable Mask */
#define PMC_PCDR1_PID55(value)                (PMC_PCDR1_PID55_Msk & (_UINT32_(value) << PMC_PCDR1_PID55_Pos)) /* Assigment of value for PID55 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID56_Pos                   _UINT32_(24)                                         /* (PMC_PCDR1) Peripheral Clock 56 Disable Position */
#define PMC_PCDR1_PID56_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID56_Pos)               /* (PMC_PCDR1) Peripheral Clock 56 Disable Mask */
#define PMC_PCDR1_PID56(value)                (PMC_PCDR1_PID56_Msk & (_UINT32_(value) << PMC_PCDR1_PID56_Pos)) /* Assigment of value for PID56 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID57_Pos                   _UINT32_(25)                                         /* (PMC_PCDR1) Peripheral Clock 57 Disable Position */
#define PMC_PCDR1_PID57_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID57_Pos)               /* (PMC_PCDR1) Peripheral Clock 57 Disable Mask */
#define PMC_PCDR1_PID57(value)                (PMC_PCDR1_PID57_Msk & (_UINT32_(value) << PMC_PCDR1_PID57_Pos)) /* Assigment of value for PID57 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID58_Pos                   _UINT32_(26)                                         /* (PMC_PCDR1) Peripheral Clock 58 Disable Position */
#define PMC_PCDR1_PID58_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID58_Pos)               /* (PMC_PCDR1) Peripheral Clock 58 Disable Mask */
#define PMC_PCDR1_PID58(value)                (PMC_PCDR1_PID58_Msk & (_UINT32_(value) << PMC_PCDR1_PID58_Pos)) /* Assigment of value for PID58 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID59_Pos                   _UINT32_(27)                                         /* (PMC_PCDR1) Peripheral Clock 59 Disable Position */
#define PMC_PCDR1_PID59_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID59_Pos)               /* (PMC_PCDR1) Peripheral Clock 59 Disable Mask */
#define PMC_PCDR1_PID59(value)                (PMC_PCDR1_PID59_Msk & (_UINT32_(value) << PMC_PCDR1_PID59_Pos)) /* Assigment of value for PID59 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID60_Pos                   _UINT32_(28)                                         /* (PMC_PCDR1) Peripheral Clock 60 Disable Position */
#define PMC_PCDR1_PID60_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID60_Pos)               /* (PMC_PCDR1) Peripheral Clock 60 Disable Mask */
#define PMC_PCDR1_PID60(value)                (PMC_PCDR1_PID60_Msk & (_UINT32_(value) << PMC_PCDR1_PID60_Pos)) /* Assigment of value for PID60 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID61_Pos                   _UINT32_(29)                                         /* (PMC_PCDR1) Peripheral Clock 61 Disable Position */
#define PMC_PCDR1_PID61_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID61_Pos)               /* (PMC_PCDR1) Peripheral Clock 61 Disable Mask */
#define PMC_PCDR1_PID61(value)                (PMC_PCDR1_PID61_Msk & (_UINT32_(value) << PMC_PCDR1_PID61_Pos)) /* Assigment of value for PID61 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID62_Pos                   _UINT32_(30)                                         /* (PMC_PCDR1) Peripheral Clock 62 Disable Position */
#define PMC_PCDR1_PID62_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID62_Pos)               /* (PMC_PCDR1) Peripheral Clock 62 Disable Mask */
#define PMC_PCDR1_PID62(value)                (PMC_PCDR1_PID62_Msk & (_UINT32_(value) << PMC_PCDR1_PID62_Pos)) /* Assigment of value for PID62 in the PMC_PCDR1 register */
#define PMC_PCDR1_PID63_Pos                   _UINT32_(31)                                         /* (PMC_PCDR1) Peripheral Clock 63 Disable Position */
#define PMC_PCDR1_PID63_Msk                   (_UINT32_(0x1) << PMC_PCDR1_PID63_Pos)               /* (PMC_PCDR1) Peripheral Clock 63 Disable Mask */
#define PMC_PCDR1_PID63(value)                (PMC_PCDR1_PID63_Msk & (_UINT32_(value) << PMC_PCDR1_PID63_Pos)) /* Assigment of value for PID63 in the PMC_PCDR1 register */
#define PMC_PCDR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PMC_PCDR1) Register Mask  */

#define PMC_PCDR1_PID_Pos                     _UINT32_(0)                                          /* (PMC_PCDR1 Position) Peripheral Clock 63 Disable */
#define PMC_PCDR1_PID_Msk                     (_UINT32_(0xFFFFFFFF) << PMC_PCDR1_PID_Pos)          /* (PMC_PCDR1 Mask) PID */
#define PMC_PCDR1_PID(value)                  (PMC_PCDR1_PID_Msk & (_UINT32_(value) << PMC_PCDR1_PID_Pos)) 

