Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D29_DFP/component/pmc.h
#define PMC_PCSR1_PID_Pos                     _UINT32_(0)                                          /* (PMC_PCSR1 Position) Peripheral Clock 63 Status */
#define PMC_PCSR1_PID_Msk                     (_UINT32_(0xFFFFFFFF) << PMC_PCSR1_PID_Pos)          /* (PMC_PCSR1 Mask) PID */
#define PMC_PCSR1_PID(value)                  (PMC_PCSR1_PID_Msk & (_UINT32_(value) << PMC_PCSR1_PID_Pos)) 

/* -------- PMC_PCR : (PMC Offset: 0x10C) (R/W 32) Peripheral Control Register -------- */
#define PMC_PCR_PID_Pos                       _UINT32_(0)                                          /* (PMC_PCR) Peripheral ID Position */
#define PMC_PCR_PID_Msk                       (_UINT32_(0x7F) << PMC_PCR_PID_Pos)                  /* (PMC_PCR) Peripheral ID Mask */
#define PMC_PCR_PID(value)                    (PMC_PCR_PID_Msk & (_UINT32_(value) << PMC_PCR_PID_Pos)) /* Assigment of value for PID in the PMC_PCR register */
#define PMC_PCR_GCKCSS_Pos                    _UINT32_(8)                                          /* (PMC_PCR) Generic Clock Source Selection Position */
#define PMC_PCR_GCKCSS_Msk                    (_UINT32_(0x7) << PMC_PCR_GCKCSS_Pos)                /* (PMC_PCR) Generic Clock Source Selection Mask */
#define PMC_PCR_GCKCSS(value)                 (PMC_PCR_GCKCSS_Msk & (_UINT32_(value) << PMC_PCR_GCKCSS_Pos)) /* Assigment of value for GCKCSS in the PMC_PCR register */
#define   PMC_PCR_GCKCSS_SLOW_CLK_Val         _UINT32_(0x0)                                        /* (PMC_PCR) Slow clock is selected  */
#define   PMC_PCR_GCKCSS_MAIN_CLK_Val         _UINT32_(0x1)                                        /* (PMC_PCR) Main clock is selected  */
#define   PMC_PCR_GCKCSS_PLLA_CLK_Val         _UINT32_(0x2)                                        /* (PMC_PCR) PLLACK is selected  */
#define   PMC_PCR_GCKCSS_UPLL_CLK_Val         _UINT32_(0x3)                                        /* (PMC_PCR) UPLL Clock is selected  */
#define   PMC_PCR_GCKCSS_MCK_CLK_Val          _UINT32_(0x4)                                        /* (PMC_PCR) Master Clock is selected  */
#define   PMC_PCR_GCKCSS_AUDIO_CLK_Val        _UINT32_(0x5)                                        /* (PMC_PCR) Audio PLL clock is selected  */
#define PMC_PCR_GCKCSS_SLOW_CLK               (PMC_PCR_GCKCSS_SLOW_CLK_Val << PMC_PCR_GCKCSS_Pos)  /* (PMC_PCR) Slow clock is selected Position  */
#define PMC_PCR_GCKCSS_MAIN_CLK               (PMC_PCR_GCKCSS_MAIN_CLK_Val << PMC_PCR_GCKCSS_Pos)  /* (PMC_PCR) Main clock is selected Position  */
#define PMC_PCR_GCKCSS_PLLA_CLK               (PMC_PCR_GCKCSS_PLLA_CLK_Val << PMC_PCR_GCKCSS_Pos)  /* (PMC_PCR) PLLACK is selected Position  */
#define PMC_PCR_GCKCSS_UPLL_CLK               (PMC_PCR_GCKCSS_UPLL_CLK_Val << PMC_PCR_GCKCSS_Pos)  /* (PMC_PCR) UPLL Clock is selected Position  */
#define PMC_PCR_GCKCSS_MCK_CLK                (PMC_PCR_GCKCSS_MCK_CLK_Val << PMC_PCR_GCKCSS_Pos)   /* (PMC_PCR) Master Clock is selected Position  */
#define PMC_PCR_GCKCSS_AUDIO_CLK              (PMC_PCR_GCKCSS_AUDIO_CLK_Val << PMC_PCR_GCKCSS_Pos) /* (PMC_PCR) Audio PLL clock is selected Position  */
#define PMC_PCR_CMD_Pos                       _UINT32_(12)                                         /* (PMC_PCR) Command Position */
#define PMC_PCR_CMD_Msk                       (_UINT32_(0x1) << PMC_PCR_CMD_Pos)                   /* (PMC_PCR) Command Mask */
#define PMC_PCR_CMD(value)                    (PMC_PCR_CMD_Msk & (_UINT32_(value) << PMC_PCR_CMD_Pos)) /* Assigment of value for CMD in the PMC_PCR register */
#define PMC_PCR_GCKDIV_Pos                    _UINT32_(20)                                         /* (PMC_PCR) Generic Clock Division Ratio Position */
#define PMC_PCR_GCKDIV_Msk                    (_UINT32_(0xFF) << PMC_PCR_GCKDIV_Pos)               /* (PMC_PCR) Generic Clock Division Ratio Mask */
#define PMC_PCR_GCKDIV(value)                 (PMC_PCR_GCKDIV_Msk & (_UINT32_(value) << PMC_PCR_GCKDIV_Pos)) /* Assigment of value for GCKDIV in the PMC_PCR register */
#define PMC_PCR_EN_Pos                        _UINT32_(28)                                         /* (PMC_PCR) Enable Position */
#define PMC_PCR_EN_Msk                        (_UINT32_(0x1) << PMC_PCR_EN_Pos)                    /* (PMC_PCR) Enable Mask */
#define PMC_PCR_EN(value)                     (PMC_PCR_EN_Msk & (_UINT32_(value) << PMC_PCR_EN_Pos)) /* Assigment of value for EN in the PMC_PCR register */
#define PMC_PCR_GCKEN_Pos                     _UINT32_(29)                                         /* (PMC_PCR) Generic Clock Enable Position */
#define PMC_PCR_GCKEN_Msk                     (_UINT32_(0x1) << PMC_PCR_GCKEN_Pos)                 /* (PMC_PCR) Generic Clock Enable Mask */
#define PMC_PCR_GCKEN(value)                  (PMC_PCR_GCKEN_Msk & (_UINT32_(value) << PMC_PCR_GCKEN_Pos)) /* Assigment of value for GCKEN in the PMC_PCR register */
#define PMC_PCR_Msk                           _UINT32_(0x3FF0177F)                                 /* (PMC_PCR) Register Mask  */


/* -------- PMC_OCR : (PMC Offset: 0x110) (R/W 32) Oscillator Calibration Register -------- */
#define PMC_OCR_CAL_Pos                       _UINT32_(0)                                          /* (PMC_OCR) 12 MHz RC Oscillator Calibration Bits Position */
#define PMC_OCR_CAL_Msk                       (_UINT32_(0x7F) << PMC_OCR_CAL_Pos)                  /* (PMC_OCR) 12 MHz RC Oscillator Calibration Bits Mask */
#define PMC_OCR_CAL(value)                    (PMC_OCR_CAL_Msk & (_UINT32_(value) << PMC_OCR_CAL_Pos)) /* Assigment of value for CAL in the PMC_OCR register */
#define PMC_OCR_SEL_Pos                       _UINT32_(7)                                          /* (PMC_OCR) Selection of RC Oscillator Calibration Bits Position */
#define PMC_OCR_SEL_Msk                       (_UINT32_(0x1) << PMC_OCR_SEL_Pos)                   /* (PMC_OCR) Selection of RC Oscillator Calibration Bits Mask */
#define PMC_OCR_SEL(value)                    (PMC_OCR_SEL_Msk & (_UINT32_(value) << PMC_OCR_SEL_Pos)) /* Assigment of value for SEL in the PMC_OCR register */
#define PMC_OCR_Msk                           _UINT32_(0x000000FF)                                 /* (PMC_OCR) Register Mask  */


/* -------- PMC_SLPWK_ER0 : (PMC Offset: 0x114) ( /W 32) SleepWalking Enable Register 0 -------- */
#define PMC_SLPWK_ER0_PID19_Pos               _UINT32_(19)                                         /* (PMC_SLPWK_ER0) Peripheral 19 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID19_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID19_Pos)           /* (PMC_SLPWK_ER0) Peripheral 19 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID19(value)            (PMC_SLPWK_ER0_PID19_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID19_Pos)) /* Assigment of value for PID19 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID20_Pos               _UINT32_(20)                                         /* (PMC_SLPWK_ER0) Peripheral 20 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID20_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID20_Pos)           /* (PMC_SLPWK_ER0) Peripheral 20 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID20(value)            (PMC_SLPWK_ER0_PID20_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID20_Pos)) /* Assigment of value for PID20 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID21_Pos               _UINT32_(21)                                         /* (PMC_SLPWK_ER0) Peripheral 21 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID21_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID21_Pos)           /* (PMC_SLPWK_ER0) Peripheral 21 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID21(value)            (PMC_SLPWK_ER0_PID21_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID21_Pos)) /* Assigment of value for PID21 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID22_Pos               _UINT32_(22)                                         /* (PMC_SLPWK_ER0) Peripheral 22 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID22_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID22_Pos)           /* (PMC_SLPWK_ER0) Peripheral 22 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID22(value)            (PMC_SLPWK_ER0_PID22_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID22_Pos)) /* Assigment of value for PID22 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID23_Pos               _UINT32_(23)                                         /* (PMC_SLPWK_ER0) Peripheral 23 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID23_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID23_Pos)           /* (PMC_SLPWK_ER0) Peripheral 23 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID23(value)            (PMC_SLPWK_ER0_PID23_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID23_Pos)) /* Assigment of value for PID23 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID24_Pos               _UINT32_(24)                                         /* (PMC_SLPWK_ER0) Peripheral 24 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID24_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID24_Pos)           /* (PMC_SLPWK_ER0) Peripheral 24 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID24(value)            (PMC_SLPWK_ER0_PID24_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID24_Pos)) /* Assigment of value for PID24 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID25_Pos               _UINT32_(25)                                         /* (PMC_SLPWK_ER0) Peripheral 25 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID25_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID25_Pos)           /* (PMC_SLPWK_ER0) Peripheral 25 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID25(value)            (PMC_SLPWK_ER0_PID25_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID25_Pos)) /* Assigment of value for PID25 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID26_Pos               _UINT32_(26)                                         /* (PMC_SLPWK_ER0) Peripheral 26 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID26_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID26_Pos)           /* (PMC_SLPWK_ER0) Peripheral 26 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID26(value)            (PMC_SLPWK_ER0_PID26_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID26_Pos)) /* Assigment of value for PID26 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID27_Pos               _UINT32_(27)                                         /* (PMC_SLPWK_ER0) Peripheral 27 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID27_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID27_Pos)           /* (PMC_SLPWK_ER0) Peripheral 27 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID27(value)            (PMC_SLPWK_ER0_PID27_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID27_Pos)) /* Assigment of value for PID27 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID28_Pos               _UINT32_(28)                                         /* (PMC_SLPWK_ER0) Peripheral 28 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID28_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID28_Pos)           /* (PMC_SLPWK_ER0) Peripheral 28 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID28(value)            (PMC_SLPWK_ER0_PID28_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID28_Pos)) /* Assigment of value for PID28 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID29_Pos               _UINT32_(29)                                         /* (PMC_SLPWK_ER0) Peripheral 29 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID29_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID29_Pos)           /* (PMC_SLPWK_ER0) Peripheral 29 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID29(value)            (PMC_SLPWK_ER0_PID29_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID29_Pos)) /* Assigment of value for PID29 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_PID30_Pos               _UINT32_(30)                                         /* (PMC_SLPWK_ER0) Peripheral 30 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID30_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER0_PID30_Pos)           /* (PMC_SLPWK_ER0) Peripheral 30 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID30(value)            (PMC_SLPWK_ER0_PID30_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID30_Pos)) /* Assigment of value for PID30 in the PMC_SLPWK_ER0 register */
#define PMC_SLPWK_ER0_Msk                     _UINT32_(0x7FF80000)                                 /* (PMC_SLPWK_ER0) Register Mask  */

#define PMC_SLPWK_ER0_PID_Pos                 _UINT32_(19)                                         /* (PMC_SLPWK_ER0 Position) Peripheral 3x SleepWalking Enable */
#define PMC_SLPWK_ER0_PID_Msk                 (_UINT32_(0xFFF) << PMC_SLPWK_ER0_PID_Pos)           /* (PMC_SLPWK_ER0 Mask) PID */
#define PMC_SLPWK_ER0_PID(value)              (PMC_SLPWK_ER0_PID_Msk & (_UINT32_(value) << PMC_SLPWK_ER0_PID_Pos)) 

/* -------- PMC_SLPWK_DR0 : (PMC Offset: 0x118) ( /W 32) SleepWalking Disable Register 0 -------- */
#define PMC_SLPWK_DR0_PID19_Pos               _UINT32_(19)                                         /* (PMC_SLPWK_DR0) Peripheral 19 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID19_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID19_Pos)           /* (PMC_SLPWK_DR0) Peripheral 19 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID19(value)            (PMC_SLPWK_DR0_PID19_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID19_Pos)) /* Assigment of value for PID19 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID20_Pos               _UINT32_(20)                                         /* (PMC_SLPWK_DR0) Peripheral 20 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID20_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID20_Pos)           /* (PMC_SLPWK_DR0) Peripheral 20 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID20(value)            (PMC_SLPWK_DR0_PID20_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID20_Pos)) /* Assigment of value for PID20 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID21_Pos               _UINT32_(21)                                         /* (PMC_SLPWK_DR0) Peripheral 21 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID21_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID21_Pos)           /* (PMC_SLPWK_DR0) Peripheral 21 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID21(value)            (PMC_SLPWK_DR0_PID21_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID21_Pos)) /* Assigment of value for PID21 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID22_Pos               _UINT32_(22)                                         /* (PMC_SLPWK_DR0) Peripheral 22 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID22_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID22_Pos)           /* (PMC_SLPWK_DR0) Peripheral 22 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID22(value)            (PMC_SLPWK_DR0_PID22_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID22_Pos)) /* Assigment of value for PID22 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID23_Pos               _UINT32_(23)                                         /* (PMC_SLPWK_DR0) Peripheral 23 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID23_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID23_Pos)           /* (PMC_SLPWK_DR0) Peripheral 23 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID23(value)            (PMC_SLPWK_DR0_PID23_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID23_Pos)) /* Assigment of value for PID23 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID24_Pos               _UINT32_(24)                                         /* (PMC_SLPWK_DR0) Peripheral 24 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID24_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID24_Pos)           /* (PMC_SLPWK_DR0) Peripheral 24 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID24(value)            (PMC_SLPWK_DR0_PID24_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID24_Pos)) /* Assigment of value for PID24 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID25_Pos               _UINT32_(25)                                         /* (PMC_SLPWK_DR0) Peripheral 25 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID25_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID25_Pos)           /* (PMC_SLPWK_DR0) Peripheral 25 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID25(value)            (PMC_SLPWK_DR0_PID25_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID25_Pos)) /* Assigment of value for PID25 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID26_Pos               _UINT32_(26)                                         /* (PMC_SLPWK_DR0) Peripheral 26 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID26_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID26_Pos)           /* (PMC_SLPWK_DR0) Peripheral 26 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID26(value)            (PMC_SLPWK_DR0_PID26_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID26_Pos)) /* Assigment of value for PID26 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID27_Pos               _UINT32_(27)                                         /* (PMC_SLPWK_DR0) Peripheral 27 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID27_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID27_Pos)           /* (PMC_SLPWK_DR0) Peripheral 27 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID27(value)            (PMC_SLPWK_DR0_PID27_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID27_Pos)) /* Assigment of value for PID27 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID28_Pos               _UINT32_(28)                                         /* (PMC_SLPWK_DR0) Peripheral 28 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID28_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID28_Pos)           /* (PMC_SLPWK_DR0) Peripheral 28 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID28(value)            (PMC_SLPWK_DR0_PID28_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID28_Pos)) /* Assigment of value for PID28 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID29_Pos               _UINT32_(29)                                         /* (PMC_SLPWK_DR0) Peripheral 29 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID29_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID29_Pos)           /* (PMC_SLPWK_DR0) Peripheral 29 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID29(value)            (PMC_SLPWK_DR0_PID29_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID29_Pos)) /* Assigment of value for PID29 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_PID30_Pos               _UINT32_(30)                                         /* (PMC_SLPWK_DR0) Peripheral 30 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID30_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR0_PID30_Pos)           /* (PMC_SLPWK_DR0) Peripheral 30 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID30(value)            (PMC_SLPWK_DR0_PID30_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID30_Pos)) /* Assigment of value for PID30 in the PMC_SLPWK_DR0 register */
#define PMC_SLPWK_DR0_Msk                     _UINT32_(0x7FF80000)                                 /* (PMC_SLPWK_DR0) Register Mask  */

#define PMC_SLPWK_DR0_PID_Pos                 _UINT32_(19)                                         /* (PMC_SLPWK_DR0 Position) Peripheral 3x SleepWalking Disable */
#define PMC_SLPWK_DR0_PID_Msk                 (_UINT32_(0xFFF) << PMC_SLPWK_DR0_PID_Pos)           /* (PMC_SLPWK_DR0 Mask) PID */
#define PMC_SLPWK_DR0_PID(value)              (PMC_SLPWK_DR0_PID_Msk & (_UINT32_(value) << PMC_SLPWK_DR0_PID_Pos)) 

