Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D29_DFP/component/pmc.h
/* -------- PMC_SLPWK_SR0 : (PMC Offset: 0x11C) ( R/ 32) SleepWalking Status Register 0 -------- */
#define PMC_SLPWK_SR0_PID19_Pos               _UINT32_(19)                                         /* (PMC_SLPWK_SR0) Peripheral 19 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID19_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID19_Pos)           /* (PMC_SLPWK_SR0) Peripheral 19 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID19(value)            (PMC_SLPWK_SR0_PID19_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID19_Pos)) /* Assigment of value for PID19 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID20_Pos               _UINT32_(20)                                         /* (PMC_SLPWK_SR0) Peripheral 20 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID20_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID20_Pos)           /* (PMC_SLPWK_SR0) Peripheral 20 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID20(value)            (PMC_SLPWK_SR0_PID20_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID20_Pos)) /* Assigment of value for PID20 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID21_Pos               _UINT32_(21)                                         /* (PMC_SLPWK_SR0) Peripheral 21 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID21_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID21_Pos)           /* (PMC_SLPWK_SR0) Peripheral 21 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID21(value)            (PMC_SLPWK_SR0_PID21_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID21_Pos)) /* Assigment of value for PID21 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID22_Pos               _UINT32_(22)                                         /* (PMC_SLPWK_SR0) Peripheral 22 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID22_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID22_Pos)           /* (PMC_SLPWK_SR0) Peripheral 22 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID22(value)            (PMC_SLPWK_SR0_PID22_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID22_Pos)) /* Assigment of value for PID22 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID23_Pos               _UINT32_(23)                                         /* (PMC_SLPWK_SR0) Peripheral 23 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID23_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID23_Pos)           /* (PMC_SLPWK_SR0) Peripheral 23 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID23(value)            (PMC_SLPWK_SR0_PID23_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID23_Pos)) /* Assigment of value for PID23 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID24_Pos               _UINT32_(24)                                         /* (PMC_SLPWK_SR0) Peripheral 24 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID24_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID24_Pos)           /* (PMC_SLPWK_SR0) Peripheral 24 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID24(value)            (PMC_SLPWK_SR0_PID24_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID24_Pos)) /* Assigment of value for PID24 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID25_Pos               _UINT32_(25)                                         /* (PMC_SLPWK_SR0) Peripheral 25 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID25_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID25_Pos)           /* (PMC_SLPWK_SR0) Peripheral 25 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID25(value)            (PMC_SLPWK_SR0_PID25_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID25_Pos)) /* Assigment of value for PID25 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID26_Pos               _UINT32_(26)                                         /* (PMC_SLPWK_SR0) Peripheral 26 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID26_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID26_Pos)           /* (PMC_SLPWK_SR0) Peripheral 26 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID26(value)            (PMC_SLPWK_SR0_PID26_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID26_Pos)) /* Assigment of value for PID26 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID27_Pos               _UINT32_(27)                                         /* (PMC_SLPWK_SR0) Peripheral 27 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID27_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID27_Pos)           /* (PMC_SLPWK_SR0) Peripheral 27 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID27(value)            (PMC_SLPWK_SR0_PID27_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID27_Pos)) /* Assigment of value for PID27 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID28_Pos               _UINT32_(28)                                         /* (PMC_SLPWK_SR0) Peripheral 28 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID28_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID28_Pos)           /* (PMC_SLPWK_SR0) Peripheral 28 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID28(value)            (PMC_SLPWK_SR0_PID28_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID28_Pos)) /* Assigment of value for PID28 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID29_Pos               _UINT32_(29)                                         /* (PMC_SLPWK_SR0) Peripheral 29 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID29_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID29_Pos)           /* (PMC_SLPWK_SR0) Peripheral 29 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID29(value)            (PMC_SLPWK_SR0_PID29_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID29_Pos)) /* Assigment of value for PID29 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_PID30_Pos               _UINT32_(30)                                         /* (PMC_SLPWK_SR0) Peripheral 30 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID30_Msk               (_UINT32_(0x1) << PMC_SLPWK_SR0_PID30_Pos)           /* (PMC_SLPWK_SR0) Peripheral 30 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID30(value)            (PMC_SLPWK_SR0_PID30_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID30_Pos)) /* Assigment of value for PID30 in the PMC_SLPWK_SR0 register */
#define PMC_SLPWK_SR0_Msk                     _UINT32_(0x7FF80000)                                 /* (PMC_SLPWK_SR0) Register Mask  */

#define PMC_SLPWK_SR0_PID_Pos                 _UINT32_(19)                                         /* (PMC_SLPWK_SR0 Position) Peripheral 3x SleepWalking Status */
#define PMC_SLPWK_SR0_PID_Msk                 (_UINT32_(0xFFF) << PMC_SLPWK_SR0_PID_Pos)           /* (PMC_SLPWK_SR0 Mask) PID */
#define PMC_SLPWK_SR0_PID(value)              (PMC_SLPWK_SR0_PID_Msk & (_UINT32_(value) << PMC_SLPWK_SR0_PID_Pos)) 

/* -------- PMC_SLPWK_ASR0 : (PMC Offset: 0x120) ( R/ 32) SleepWalking Activity Status Register 0 -------- */
#define PMC_SLPWK_ASR0_PID19_Pos              _UINT32_(19)                                         /* (PMC_SLPWK_ASR0) Peripheral 19 Activity Status Position */
#define PMC_SLPWK_ASR0_PID19_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID19_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 19 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID19(value)           (PMC_SLPWK_ASR0_PID19_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID19_Pos)) /* Assigment of value for PID19 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID20_Pos              _UINT32_(20)                                         /* (PMC_SLPWK_ASR0) Peripheral 20 Activity Status Position */
#define PMC_SLPWK_ASR0_PID20_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID20_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 20 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID20(value)           (PMC_SLPWK_ASR0_PID20_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID20_Pos)) /* Assigment of value for PID20 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID21_Pos              _UINT32_(21)                                         /* (PMC_SLPWK_ASR0) Peripheral 21 Activity Status Position */
#define PMC_SLPWK_ASR0_PID21_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID21_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 21 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID21(value)           (PMC_SLPWK_ASR0_PID21_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID21_Pos)) /* Assigment of value for PID21 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID22_Pos              _UINT32_(22)                                         /* (PMC_SLPWK_ASR0) Peripheral 22 Activity Status Position */
#define PMC_SLPWK_ASR0_PID22_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID22_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 22 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID22(value)           (PMC_SLPWK_ASR0_PID22_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID22_Pos)) /* Assigment of value for PID22 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID23_Pos              _UINT32_(23)                                         /* (PMC_SLPWK_ASR0) Peripheral 23 Activity Status Position */
#define PMC_SLPWK_ASR0_PID23_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID23_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 23 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID23(value)           (PMC_SLPWK_ASR0_PID23_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID23_Pos)) /* Assigment of value for PID23 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID24_Pos              _UINT32_(24)                                         /* (PMC_SLPWK_ASR0) Peripheral 24 Activity Status Position */
#define PMC_SLPWK_ASR0_PID24_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID24_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 24 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID24(value)           (PMC_SLPWK_ASR0_PID24_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID24_Pos)) /* Assigment of value for PID24 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID25_Pos              _UINT32_(25)                                         /* (PMC_SLPWK_ASR0) Peripheral 25 Activity Status Position */
#define PMC_SLPWK_ASR0_PID25_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID25_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 25 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID25(value)           (PMC_SLPWK_ASR0_PID25_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID25_Pos)) /* Assigment of value for PID25 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID26_Pos              _UINT32_(26)                                         /* (PMC_SLPWK_ASR0) Peripheral 26 Activity Status Position */
#define PMC_SLPWK_ASR0_PID26_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID26_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 26 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID26(value)           (PMC_SLPWK_ASR0_PID26_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID26_Pos)) /* Assigment of value for PID26 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID27_Pos              _UINT32_(27)                                         /* (PMC_SLPWK_ASR0) Peripheral 27 Activity Status Position */
#define PMC_SLPWK_ASR0_PID27_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID27_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 27 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID27(value)           (PMC_SLPWK_ASR0_PID27_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID27_Pos)) /* Assigment of value for PID27 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID28_Pos              _UINT32_(28)                                         /* (PMC_SLPWK_ASR0) Peripheral 28 Activity Status Position */
#define PMC_SLPWK_ASR0_PID28_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID28_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 28 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID28(value)           (PMC_SLPWK_ASR0_PID28_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID28_Pos)) /* Assigment of value for PID28 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID29_Pos              _UINT32_(29)                                         /* (PMC_SLPWK_ASR0) Peripheral 29 Activity Status Position */
#define PMC_SLPWK_ASR0_PID29_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID29_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 29 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID29(value)           (PMC_SLPWK_ASR0_PID29_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID29_Pos)) /* Assigment of value for PID29 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_PID30_Pos              _UINT32_(30)                                         /* (PMC_SLPWK_ASR0) Peripheral 30 Activity Status Position */
#define PMC_SLPWK_ASR0_PID30_Msk              (_UINT32_(0x1) << PMC_SLPWK_ASR0_PID30_Pos)          /* (PMC_SLPWK_ASR0) Peripheral 30 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID30(value)           (PMC_SLPWK_ASR0_PID30_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID30_Pos)) /* Assigment of value for PID30 in the PMC_SLPWK_ASR0 register */
#define PMC_SLPWK_ASR0_Msk                    _UINT32_(0x7FF80000)                                 /* (PMC_SLPWK_ASR0) Register Mask  */

#define PMC_SLPWK_ASR0_PID_Pos                _UINT32_(19)                                         /* (PMC_SLPWK_ASR0 Position) Peripheral 3x Activity Status */
#define PMC_SLPWK_ASR0_PID_Msk                (_UINT32_(0xFFF) << PMC_SLPWK_ASR0_PID_Pos)          /* (PMC_SLPWK_ASR0 Mask) PID */
#define PMC_SLPWK_ASR0_PID(value)             (PMC_SLPWK_ASR0_PID_Msk & (_UINT32_(value) << PMC_SLPWK_ASR0_PID_Pos)) 

/* -------- PMC_SLPWK_ER1 : (PMC Offset: 0x134) ( /W 32) SleepWalking Enable Register 1 -------- */
#define PMC_SLPWK_ER1_PID33_Pos               _UINT32_(1)                                          /* (PMC_SLPWK_ER1) Peripheral 33 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID33_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER1_PID33_Pos)           /* (PMC_SLPWK_ER1) Peripheral 33 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID33(value)            (PMC_SLPWK_ER1_PID33_Msk & (_UINT32_(value) << PMC_SLPWK_ER1_PID33_Pos)) /* Assigment of value for PID33 in the PMC_SLPWK_ER1 register */
#define PMC_SLPWK_ER1_PID34_Pos               _UINT32_(2)                                          /* (PMC_SLPWK_ER1) Peripheral 34 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID34_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER1_PID34_Pos)           /* (PMC_SLPWK_ER1) Peripheral 34 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID34(value)            (PMC_SLPWK_ER1_PID34_Msk & (_UINT32_(value) << PMC_SLPWK_ER1_PID34_Pos)) /* Assigment of value for PID34 in the PMC_SLPWK_ER1 register */
#define PMC_SLPWK_ER1_PID40_Pos               _UINT32_(8)                                          /* (PMC_SLPWK_ER1) Peripheral 40 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID40_Msk               (_UINT32_(0x1) << PMC_SLPWK_ER1_PID40_Pos)           /* (PMC_SLPWK_ER1) Peripheral 40 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID40(value)            (PMC_SLPWK_ER1_PID40_Msk & (_UINT32_(value) << PMC_SLPWK_ER1_PID40_Pos)) /* Assigment of value for PID40 in the PMC_SLPWK_ER1 register */
#define PMC_SLPWK_ER1_Msk                     _UINT32_(0x00000106)                                 /* (PMC_SLPWK_ER1) Register Mask  */

#define PMC_SLPWK_ER1_PID_Pos                 _UINT32_(1)                                          /* (PMC_SLPWK_ER1 Position) Peripheral 4x SleepWalking Enable */
#define PMC_SLPWK_ER1_PID_Msk                 (_UINT32_(0x7) << PMC_SLPWK_ER1_PID_Pos)             /* (PMC_SLPWK_ER1 Mask) PID */
#define PMC_SLPWK_ER1_PID(value)              (PMC_SLPWK_ER1_PID_Msk & (_UINT32_(value) << PMC_SLPWK_ER1_PID_Pos)) 

